/*Μια εταιρεία ηλεκτρισμού χρεώνει την κατανάλωση ρεύματος ως εξής:
-Πάγιο ποσό 5€ τον μήνα
-Για τις πρώτες 500 kwh η χρέωση είναι 0.5€/kwh
-Για τις επόμενες 400 kwh η χρέωση είναι αυξημένη κατά 8% σε σχέση με την προηγούμενη κλίμακα
-Για τις επόμενες 200 kwh η χρέωση είναι αυξημένη κατά 12% σε σχέση με την προηγούμενη κλίμακα
-Για κάθε επόμενη kwh και ως τις 4000kwh η χρέωση είναι αυξημένη κατά 20% σε σχέση με την προηγούμενη κλίμακα
Να γραφεί πρόγραμμα στο οποίο ο χρήστης θα εισάγει int αριθμό που αντιστοιχεί στην μηνιαία κατανάλωση kwh και να υπολογίζεται η συνολική χρέωση.
Θεωρήστε πως η συνολική μηνιαία κατανάλωση δεν μπορεί να ξεπεράσει τις 4000kwh. Σε περίπτωση που ο χρήστης εισάγει μη έκγυρη τιμή για khw, το πρόγραμμα να
τερματίζει εμφανίζοντας κατάλληλο μήνυμα.
*/

#include <iostream>

using std::cin;
using std::cout;
using std::endl;

int main() {
    int kwh;
    float euro;
    cout << "Dwse arithmo kwh: ";
    cin >> kwh;
    if (kwh < 0 || kwh > 4000) {
        cout << "Lathos timh, to programma tha termatistei." << endl;
        exit(0);
    } else if (kwh <= 500) {
        euro = 5 + kwh * 0.5;
    } else if (kwh <= 500 + 400) {
        euro = 5 + 500 * 0.5 + (kwh - 500) * 0.5 * 1.08;
    } else if (kwh <= 500 + 400 + 200) {
        euro = 5 + 500 * 0.5 + 400 * 0.5 * 1.08 + (kwh - 500 - 400) * 0.5 * 1.08 * 1.12;
    } else if (kwh <= 4000) {
        euro = 5 + 500 * 0.5 + 400 * 0.5 * 1.08 + 200 * 0.5 * 1.08 * 1.12 + (kwh - 500 - 400 - 200) * 0.5 * 1.08 * 1.12 * 1.2;
    } else {
        cout << "Kati phge strava." << endl;
        exit(0);
    }
    cout << "H telikh xrewsh einai: " << euro << " €" << endl;

    return 0;
}